{
    "languages": ["en", "fr"],
    "translation": [
      {
        "en": "Mortality Analysis Report",
        "fr": "Rapport d'Analyse de Mortalité"
      },
      {
        "en": "Executive Summary",
        "fr": "Résumé Exécutif"
      },
      {
        "en": "This report presents a comprehensive mortality analysis including data quality diagnostics and life table calculations.",
        "fr": "Ce rapport présente une analyse complète de la mortalité comprenant des diagnostics de qualité des données et des calculs de table de mortalité."
      },
      {
        "en": "Preprocessing Analysis",
        "fr": "Analyse de Prétraitement"
      },
      {
        "en": "Approximate",
        "fr": "Approximatif"
      },
      {
        "en": "Highly accurate",
        "fr": "Très précis"
      },
      {
        "en": "Diagnostic Metrics",
        "fr": "Métriques de Diagnostic"
      },
      {
        "en": "Diagnostic Metrics for",
        "fr": "Métriques de Diagnostic pour"
      },
      {
        "en": "Diagnostic Plots",
        "fr": "Graphiques de Diagnostic"
      },
      {
        "en": "Summary Statistics",
        "fr": "Statistiques Récapitulatives"
      },
      {
        "en": "Summary Statistics for",
        "fr": "Statistiques Récapitulatives pour"
      },
      {
        "en": "Mortality Rates (nMx) -",
        "fr": "Taux de Mortalité (nMx) -"
      },
      {
        "en": "Survival Curve (lx) -",
        "fr": "Courbe de Survie (lx) -"
      },
      {
        "en": "Death Distribution (ndx) -",
        "fr": "Distribution des Décès (ndx) -"
      },
      {
        "en": "Death Probabilities",
        "fr": "Probabilités de Décès"
      },
      {
        "en": "Data Quality Diagnostics",
        "fr": "Diagnostics de Qualité des Données"
      },
      {
        "en": "Death Probabilities (nqx) -",
        "fr": "Probabilités de Décès (nqx) -"
      },
      {
        "en": "Description",
        "fr": "Description"
      },
      {
        "en": "Change language",
        "fr": "Changer de langue"
      },
      {
        "en": "Demographic Analysis Suite",
        "fr": "Suite d'Analyse Démographique"
      },
      {
        "en": "Go to module",
        "fr": "Aller au module"
      },
      {
        "en": "Advanced tools for demographic research and analysis",
        "fr": "Outils avancés pour la recherche et l'analyse démographique"
      },
      {
        "en": "Life Table Analysis",
        "fr": "Analyse de Table de Mortalité"
      },
      {
        "en": "Create comprehensive life tables with advanced smoothing capabilities and mortality analysis tools.",
        "fr": "Créez des tables de mortalité complètes avec des capacités avancées de lissage et des outils d'analyse de mortalité."
      },
      {
        "en": "Demographic Interpolation",
        "fr": "Interpolation Démographique"
      },
      {
        "en": "Fill data gaps and estimate demographic indicators between time points using advanced interpolation methods.",
        "fr": "Comblez les lacunes de données et estimez les indicateurs démographiques entre les points temporels à l'aide de méthodes d'interpolation avancées."
      },
      {
        "en": "Coming Soon",
        "fr": "Bientôt Disponible"
      },
      {
        "en": "Life Table Analysis Platform",
        "fr": "Plateforme d'Analyse de Table de Mortalité"
      },
      {
        "en": "Transform mortality data into comprehensive life table analyses with just a few clicks",
        "fr": "Transformez les données de mortalité en analyses complètes de table de mortalité en quelques clics"
      },
      {
        "en": "← Previous",
        "fr": "← Précédent"
      },
      {
        "en": "Upload Your Data",
        "fr": "Téléchargez Vos Données"
      },
      {
        "en": "Import your mortality data in CSV format containing Age, Deaths, and Exposures",
        "fr": "Importez vos données de mortalité au format CSV contenant l'âge, les décès et les expositions"
      },
      {
        "en": "Run Diagnostics",
        "fr": "Exécuter les Diagnostics"
      },
      {
        "en": "Analyze data quality and identify potential issues with built-in diagnostic tools",
        "fr": "Analysez la qualité des données et identifiez les problèmes potentiels avec les outils de diagnostic intégrés"
      },
      {
        "en": "Transform Data",
        "fr": "Transformer les Données"
      },
      {
        "en": "Apply sophisticated smoothing and adjustments by groups",
        "fr": "Appliquez des lissages sophistiqués et des ajustements par groupes"
      },
      {
        "en": "Get Results",
        "fr": "Obtenir les Résultats"
      },
      {
        "en": "Download complete life table results and visualizations",
        "fr": "Téléchargez les résultats complets de la table de mortalité et les visualisations"
      },
      {
        "en": "Start",
        "fr": "Commencer"
      },
      {
        "en": "Data upload and validation",
        "fr": "Téléchargement et validation des données"
      },
      {
        "en": "Begin by uploading your CSV file. Not sure about your file? Here's what we're looking for:",
        "fr": "Commencez par télécharger votre fichier CSV. Vous n'êtes pas sûr de votre fichier ? Voici ce que nous recherchons :"
      },
      {
        "en": "Exposures refer to the person-years lived over the same period where Deaths were registered. If Deaths refer to a single year, then sometimes mid-year population can be used to approximate Exposures.",
        "fr": "Les expositions font référence aux années-personnes vécues au cours de la même période où les décès ont été enregistrés. Si les décès font référence à une seule année, la population de milieu d'année peut parfois être utilisée pour approximer les expositions."
      },
      {
        "en": "Ready? Click 'Browse...' to select your file or start with our sample data.",
        "fr": "Prêt ? Cliquez sur 'Parcourir...' pour sélectionner votre fichier ou commencez avec nos données d'exemple."
      },
      {
        "en": "Instructions",
        "fr": "Instructions"
      },
      {
        "en": "Use sample data",
        "fr": "Utiliser les données d'exemple"
      },
      {
        "en": "Show Advanced Options",
        "fr": "Afficher les Options Avancées"
      },
      {
        "en": "Hide Advanced Options",
        "fr": "Masquer les Options Avancées"
      },
      {
        "en": "Next →",
        "fr": "Suivant →"
      },
      {
        "en": "Smoothing",
        "fr": "Lissage"
      },
      {
        "en": "smoothing",
        "fr": "lissage"
      },
      {
        "en": "Calculate",
        "fr": "Calculer"
      },
      {
        "en": "Reset Options",
        "fr": "Réinitialiser les Options"
      },
      {
        "en": "Execute",
        "fr": "Exécuter"
      },
      {
        "en": "Ages to fit extrapolation model",
        "fr": "Âges à ajuster pour le modèle d'extrapolation"
      },
      {
        "en": "Extrap. Jump-off Age",
        "fr": "Âge de Départ pour l'Extrapolation"
      },
      {
        "en": "Life Table Summary Statistics",
        "fr": "Statistiques de la Table de Mortalité"
      },
      {
        "en": "Download life table results",
        "fr": "Télécharger les résultats de la table de mortalité"
      },
      {
        "en": "Download preprocessing results",
        "fr": "Télécharger les résultats du prétraitement"
      },
      {
        "en": "Download diagnostic results",
        "fr": "Télécharger les résultats des diagnostics"
      },
      {
        "en": "Download PDF Report",
        "fr": "Télécharger le Rapport PDF"
      },
      {
        "en": "Download Options",
        "fr": "Options de Téléchargement"
      },
      {
        "en": "Select an option:",
        "fr": "Sélectionnez une option :"
      },
      {
        "en": "Cancel",
        "fr": "Annuler"
      },
      {
        "en": "Download",
        "fr": "Télécharger"
      },
      {
        "en": "Desired Open Age Group",
        "fr": "Groupe d'Âge Ouvert Souhaité"
      },
      {
        "en": "Group",
        "fr": "Groupe"
      },
      {
        "en": "Preparing download... Estimated time:",
        "fr": "Préparation du téléchargement... Temps estimé :"
      },
      {
        "en": "seconds",
        "fr": "secondes"
      },
      {
        "en": "minutes",
        "fr": "minutes"
      },
      {
        "en": "Output Age Classes",
        "fr": "Classes d'Âge de Sortie"
      },
      {
        "en": "single",
        "fr": "unique"
      },
      {
        "en": "abridged",
        "fr": "abrégé"
      },
      {
        "en": "Extrapolation Law",
        "fr": "Loi d'Extrapolation"
      },
      {
        "en": "Lifetable Radix",
        "fr": "Radix de la Table de Mortalité"
      },
      {
        "en": "Sex Ratio at Birth",
        "fr": "Rapport de Masculinité à la Naissance"
      },
      {
        "en": "a(0) Rule",
        "fr": "Règle a(0)"
      },
      {
        "en": "Andreev-Kingkade",
        "fr": "Andreev-Kingkade"
      },
      {
        "en": "Coale-Demeny",
        "fr": "Coale-Demeny"
      },
      {
        "en": "a(x) Method",
        "fr": "Méthode a(x)"
      },
      {
        "en": "UN (Greville)",
        "fr": "ONU (Greville)"
      },
      {
        "en": "PASEX",
        "fr": "PASEX"
      },
      {
        "en": "Language",
        "fr": "Langue"
      },
      {
        "en": "English",
        "fr": "Anglais"
      },
      {
        "en": "French",
        "fr": "Français"
      },
      {
        "en": "Join The Conversation:",
        "fr": "Rejoignez La Conversation :"
      },
      {
        "en": "Donate",
        "fr": "Faire un don"
      },
      {
        "en": "Contact",
        "fr": "Contact"
      },
      {
        "en": "Copyright",
        "fr": "Droits d'auteur"
      },
      {
        "en": "Fraud Alert",
        "fr": "Alerte à la fraude"
      },
      {
        "en": "Privacy Notice",
        "fr": "Avis de confidentialité"
      },
      {
        "en": "Site Index",
        "fr": "Index du site"
      },
      {
        "en": "Terms of Use",
        "fr": "Conditions d'utilisation"
      },
      {
        "en": "Column Selection",
        "fr": "Sélection des Colonnes"
      },
      {
        "en": "If you're analysis needs to be performed by groups (e.g Sex, Province, Region, etc..), please select the columns that group your data. If your data is not group-wise, tick the box below.",
        "fr": "Si votre analyse doit être effectuée par groupes (par exemple Sexe, Province, Région, etc.), veuillez sélectionner les colonnes qui regroupent vos données. Si vos données ne sont pas groupées, cochez la case ci-dessous."
      },
      {
        "en": "Select Identifier Columns",
        "fr": "Sélectionner les Colonnes d'Identification"
      },
      {
        "en": "No grouping needed for this analysis",
        "fr": "Pas de regroupement nécessaire pour cette analyse"
      },
      {
        "en": "Confirm",
        "fr": "Confirmer"
      },
      {
        "en": "A maximum of 3 grouping variables are allowed.",
        "fr": "Un maximum de 3 variables de regroupement est autorisé."
      },
      {
        "en": "The specified columns do not identify each row uniquely or we've identified there are grouping columns not specified.",
        "fr": "Les colonnes spécifiées n'identifient pas chaque ligne de manière unique ou nous avons identifié qu'il y a des colonnes de regroupement non spécifiées."
      },
      {
        "en": "✅ Everything is great, all checks passed!",
        "fr": "✅ Tout est parfait, tous les contrôles sont passés !"
      },
      {
        "en": "Check Failures:",
        "fr": "Échecs des contrôles :"
      },
      {
        "en": "Diagnostics",
        "fr": "Diagnostics"
      },
      {
        "en": "Continue",
        "fr": "Continuer"
      },
      {
        "en": "Age column not found",
        "fr": "Colonne âge non trouvée"
      },
      {
        "en": "Type",
        "fr": "Type"
      },
      {
        "en": "Age Scale",
        "fr": "Échelle d'Âge"
      },
      {
        "en": "Method",
        "fr": "Méthode"
      },
      {
        "en": "Result",
        "fr": "Résultat"
      },
      {
        "en": "Level",
        "fr": "Niveau"
      },
      {
        "en": "Color",
        "fr": "Couleur"
      },
      {
        "en": "Deaths column not found",
        "fr": "Colonne décès non trouvée"
      },
      {
        "en": "Exposures column not found",
        "fr": "Colonne expositions non trouvée"
      },
      {
        "en": "Duplicate ages found",
        "fr": "Âges en double trouvés"
      },
      {
        "en": "Negative values found in Deaths",
        "fr": "Valeurs négatives trouvées dans les décès"
      },
      {
        "en": "Negative values found in Exposures",
        "fr": "Valeurs négatives trouvées dans les expositions"
      },
      {
        "en": "Zero values found in Exposures",
        "fr": "Valeurs nulles trouvées dans les expositions"
      },
      {
        "en": "Data Diagnostics",
        "fr": "Diagnostics des Données"
      },
      {
        "en": "Exposures",
        "fr": "Expositions"
      },
      {
        "en": "Deaths",
        "fr": "Décès"
      },
      {
        "en": "Empirical Mx",
        "fr": "Mx Empirique"
      },
      {
        "en": "The Roughness method measures the average absolute percentage deviation from a smoothed trend through the five-year age group data. The Sawtooth method takes the average of the ratios of the value in each five-year age group (in adult ages) to the average of the two adjacent age groups (age groups below and above). Both of these methods are trying to pick up on a phenomenon known as differential age heaping where digit preference is stronger on zeroes than on fives. This phenomenon can cause an apparent sawtooth pattern in demographic count data.",
        "fr": "La méthode de Rugosité mesure l'écart absolu moyen en pourcentage par rapport à une tendance lissée à travers les données par groupe d'âge de cinq ans. La méthode en Dents de Scie prend la moyenne des ratios de la valeur dans chaque groupe d'âge de cinq ans (aux âges adultes) par rapport à la moyenne des deux groupes d'âge adjacents (groupes d'âge inférieurs et supérieurs). Ces deux méthodes tentent de détecter un phénomène connu sous le nom d'attraction différentielle des âges où la préférence pour les chiffres est plus forte sur les zéros que sur les cinq. Ce phénomène peut causer un motif apparent en dents de scie dans les données démographiques."
      },
      {
        "en": "The Myers and Bachi indices both measure digit preference for single-age data. If there were no digit preference, then the distribution over terminal digits (0-9) would be roughly uniform. Both of these indices measure the departure from uniformity, with slight variations on the implementation. Higher values indicate digit distributions that are farther from uniform. If these indices are high, but the _roughness_ and _sawtooth_ indices are low, then you might adjust data using one of the _fine_ smoothing methods offered.",
        "fr": "Les indices de Myers et Bachi mesurent tous deux la préférence pour les chiffres dans les données d'âge simple. S'il n'y avait pas de préférence pour les chiffres, la distribution sur les chiffres terminaux (0-9) serait à peu près uniforme. Ces deux indices mesurent l'écart par rapport à l'uniformité, avec de légères variations dans leur mise en œuvre. Des valeurs plus élevées indiquent des distributions de chiffres plus éloignées de l'uniforme. Si ces indices sont élevés, mais que les indices de _rugosité_ et de _dents de scie_ sont faibles, vous pourriez ajuster les données en utilisant l'une des méthodes de lissage _fin_ proposées."
      },
      {
        "en": "This step simultaneously smooths age patterns in both exposures and deaths.",
        "fr": "Cette étape lisse simultanément les modèles d'âge dans les expositions et les décès."
      },
      {
        "en": "Exposures Parameters",
        "fr": "Paramètres des Expositions"
      },
      {
        "en": "Deaths Parameters",
        "fr": "Paramètres des Décès"
      },
      {
        "en": "Rough Method (Exposures)",
        "fr": "Méthode Grossière (Expositions)"
      },
      {
        "en": "Rough Method (Deaths)",
        "fr": "Méthode Grossière (Décès)"
      },
      {
        "en": "Shared Parameters",
        "fr": "Paramètres Partagés"
      },
      {
        "en": "Age Output",
        "fr": "Sortie d'Âge"
      },
      {
        "en": "Fine Method (Exposures)",
        "fr": "Méthode Fine (Expositions)"
      },
      {
        "en": "Fine Method (Deaths)",
        "fr": "Méthode Fine (Décès)"
      },
      {
        "en": "Under-5 Mortality (optional, Exposures)",
        "fr": "Mortalité des Moins de 5 Ans (optionnel, Expositions)"
      },
      {
        "en": "Under-5 Mortality (optional, Deaths)",
        "fr": "Mortalité des Moins de 5 Ans (optionnel, Décès)"
      },
      {
        "en": "Constrain Infants (Exposures)",
        "fr": "Contraindre les Nourrissons (Expositions)"
      },
      {
        "en": "Constrain Infants (Deaths)",
        "fr": "Contraindre les Nourrissons (Décès)"
      },
      {
        "en": "If you want to test out the app's functionalty, click here to use a sample dataset. A pop up window will be prompted for the grouping variables that identify your data. Simply tick the no-grouping box and you'll be able to inspect the diagnostics and perform additional preprocessing.",
        "fr": "Si vous souhaitez tester les fonctionnalités de l'application, cliquez ici pour utiliser un jeu de données d'exemple. Une fenêtre contextuelle s'affichera pour les variables de regroupement qui identifient vos données. Cochez simplement la case sans regroupement et vous pourrez inspecter les diagnostics et effectuer un prétraitement supplémentaire."
      },
      {
        "en": "Alternatively, upload your own data. Make sure your data is cleaned and ready for analysis (no age duplicates, unless by groups), correct column names (we expect at least the basic to be 'Sex', 'Deaths' and 'Exposures'), either single or abridged ages but nothing else.",
        "fr": "Alternativement, téléchargez vos propres données. Assurez-vous que vos données sont nettoyées et prêtes pour l'analyse (pas de doublons d'âge, sauf par groupes), noms de colonnes corrects (nous attendons au minimum les bases 'Sexe', 'Décès' et 'Expositions'), âges simples ou abrégés mais rien d'autre."
      },
      {
        "en": "These are the tabs for the preprocessing. Every time you click execute from each of the preprocessing it will use the output of the previous preprocessing step.",
        "fr": "Voici les onglets pour le prétraitement. Chaque fois que vous cliquez sur exécuter depuis chaque prétraitement, il utilisera la sortie de l'étape de prétraitement précédente."
      },
      {
        "en": "In this icon you can see which data is used as input for each preprocessing, whether the initial data or the output of a previous preprocessing step.",
        "fr": "Dans cette icône, vous pouvez voir quelles données sont utilisées comme entrée pour chaque prétraitement, qu'il s'agisse des données initiales ou de la sortie d'une étape de prétraitement précédente."
      },
      {
        "en": "Once you've implemented all the preprocessing needed, you can click next to use the output of the final preprocessing step as the input to the lifetable. Equally important, if you've applied a preprocessing step, you'll see the sequential order at which they were executed as pills above this button. You can delete any step and the chain of excution will be recalculated.",
        "fr": "Une fois que vous avez implémenté tous les prétraitements nécessaires, vous pouvez cliquer sur suivant pour utiliser la sortie de l'étape finale de prétraitement comme entrée pour la table de mortalité. Tout aussi important, si vous avez appliqué une étape de prétraitement, vous verrez l'ordre séquentiel dans lequel ils ont été exécutés sous forme de pilules au-dessus de ce bouton. Vous pouvez supprimer n'importe quelle étape et la chaîne d'exécution sera recalculée."
      },
      {
        "en": "Here you can estimate the lifetable using the output of the final step of your preprocessing. After tweaking the parameters below, click here to see the plot and table outputs.",
        "fr": "Ici, vous pouvez estimer la table de mortalité en utilisant la sortie de l'étape finale de votre prétraitement. Après avoir ajusté les paramètres ci-dessous, cliquez ici pour voir les sorties graphiques et tabulaires."
      },
      {
        "en": "Preparing download:",
        "fr": "Préparation du téléchargement:"
      },
      {
        "en": "Saving lifetable results... Estimated time:",
        "fr": "Enregistrement des résultats de la table de mortalité... Temps estimé:"
      },
      {
        "en": "Saving preprocessing results... Estimated time:",
        "fr": "Enregistrement des résultats du prétraitement... Temps estimé:"
      },
      {
        "en": "Saving diagnostic results... Estimated time:",
        "fr": "Enregistrement des résultats des diagnostics... Temps estimé:"
      },
      {
        "en": "Preparing diagnostic data...",
        "fr": "Préparation des données de diagnostic..."
      },
      {
        "en": "Generating PDF report...",
        "fr": "Génération du rapport PDF..."
      },
      {
        "en": "Creating zip file...",
        "fr": "Création du fichier zip..."
      },
      {
        "en": "Export",
        "fr": "Exporter"
      },
      {
        "en": "Welcome to the United Nations",
        "fr": "Bienvenue aux Nations Unies"
      },
      {
        "en": "Data Portal",
        "fr": "Portail de Données"
      },
      {
        "en": "Population Division",
        "fr": "Division de la Population"
      },
      {
        "en": "This step will use the initial uploaded data",
        "fr": "Cette étape utilisera les données initiales téléchargées"
      },
      {
        "en": "This step uses the initial uploaded data",
        "fr": "Cette étape utilise les données initiales téléchargées"
      },
      {
        "en": "This step uses the output data from the",
        "fr": "Cette étape utilise les données de sortie de"
      },
      {
        "en": "step",
        "fr": "étape"
      },
      {
        "en": "Variable",
        "fr": "Variable"
      },
      {
        "en": "Mortality Rate",
        "fr": "Taux de Mortalité"
      },
      {
        "en": "Survival Curve",
        "fr": "Courbe de Survie"
      },
      {
        "en": "Death Distribution",
        "fr": "Distribution des Décès"
      },
      {
        "en": "Conditional Death Probabilities",
        "fr": "Probabilités Conditionnelles de Décès"
      },
      {
        "en": "Lifetable Results",
        "fr": "Résultats de la Table de Mortalité"
      },
      {
        "en": "Exposures by Age",
        "fr": "Expositions par Âge"
      },
      {
        "en": "Deaths by Age",
        "fr": "Décès par Âge"
      },
      {
        "en": "Empirical Mortality Rates (Mx) by Age",
        "fr": "Taux de Mortalité Empiriques (Mx) par Âge"
      },
      {
        "en": "Age",
        "fr": "Âge"
      },
      {
        "en": "Value",
        "fr": "Valeur"
      },
      {
        "en": "Counts",
        "fr": "Comptages"
      },
      {
        "en": "Rate",
        "fr": "Taux"
      },
      {
        "en": "Difference Between Empirical Mx and Extrapolated Values on Log10 Scale",
        "fr": "Différence Entre Mx Empirique et Valeurs Extrapolées sur Échelle Log10"
      },
      {
        "en": "Empirical",
        "fr": "Empirique"
      },
      {
        "en": "Smoothed",
        "fr": "Lissé"
      },
      {
        "en": "Extrapolated",
        "fr": "Extrapolé"
      },
      {
        "en": "Single-Age",
        "fr": "Âge Unique"
      },
      {
        "en": "Five-Year",
        "fr": "Cinq Ans"
      },
      {
        "en": "Mortality Rate (log10 scale)",
        "fr": "Taux de Mortalité (échelle log10)"
      },
      {
        "en": "Ages between: ",
        "fr": "Âges entre: "
      },
      {
        "en": "Age histogram of ",
        "fr": "Histogramme d'âge de "
      },
      {
        "en": "nMx (log10 scale)",
        "fr": "nMx (échelle log10)"
      },
      {
        "en": "nMx (log scale)",
        "fr": "nMx (échelle log)"
      },
      {
        "en": "Log transformed Age-specific mortality rate",
        "fr": "Taux de mortalité par âge transformé en logarithme"
      },
      {
        "en": "Survival curve (lx) generated from lifetable nmx values",
        "fr": "Courbe de survie (lx) générée à partir des valeurs nMx de la table de mortalité"
      },
      {
        "en": "Marked locations on the curve indicate survival quartiles",
        "fr": "Les emplacements marqués sur la courbe indiquent les quartiles de survie"
      },
      {
        "en": "Life Expectancy",
        "fr": "Espérance de Vie"
      },
      {
        "en": "Empirical Mx for a given age range on a log10 scale.",
        "fr": "Mx empirique pour une plage d'âges donnée sur une échelle log10."
      },
      {
        "en": "Original (black) and adjusted (red)",
        "fr": "Original (noir) et ajusté (rouge)"
      },
      {
        "en": "Rates (Deaths / Exposures)",
        "fr": "Taux (Décès / Expositions)"
      },
      {
        "en": "Rates",
        "fr": "Taux"
      },
      {
        "en": "lx",
        "fr": "lx"
      },
      {
        "en": "dx",
        "fr": "dx"
      },
      {
        "en": "Death distribution (dx) generated from lifetable nmx values",
        "fr": "Distribution des décès (dx) générée à partir des valeurs nMx de la table de mortalité"
      },
      {
        "en": "Marked locations on the distribution indicate age-at-death quartiles (grey)\nand life expectancy (red)",
        "fr": "Les emplacements marqués sur la distribution indiquent les quartiles d'âge à la mort (gris)\n et l'espérance de vie (rouge)"
      },
      {
        "en": "nqx",
        "fr": "nqx"
      },
      {
        "en": "nqx (log scale)",
        "fr": "nqx (échelle log)"
      },
      {
        "en": "nMx",
        "fr": "nMx"
      },
      {
        "en": "Age-specific Mortality",
        "fr": "Mortalité Spécifique à l'Âge"
      },
      {
        "en": "Comparison of empirical nMx and lifetable nmx values",
        "fr": "Comparaison des taux de mortalité empiriques et ajustés"
      },
      {
        "en": "Age_value",
        "fr": "Âge_valeur"
      },
      {
        "en": "Roughness",
        "fr": "Rugosité"
      },
      {
        "en": "Sawtooth",
        "fr": "Dents de scie"
      },
      {
        "en": "Very rough",
        "fr": "Très rugueux"
      },
      {
        "en": "Fairly accurate",
        "fr": "Assez précis"
      },
      {
        "en": "Rough",
        "fr": "Grossière"
      },
      {
        "en": "Measure",
        "fr": "Mesure"
      },
      {
        "en": "Label",
        "fr": "Étiquette"
      },
      {
        "en": "Message",
        "fr": "Message"
      },
      {
        "en": "Median",
        "fr": "Médiane"
      },
      {
        "en": "Mode",
        "fr": "Mode"
      },
      {
        "en": "Life Expectancy at Birth",
        "fr": "Espérance de Vie à la Naissance"
      },
      {
        "en": "Median Age at Death",
        "fr": "Âge Médian au Décès"
      },
      {
        "en": "Modal Age at Death",
        "fr": "Âge Modal au Décès"
      },
      {
        "en": "Remaining Life Expectancy at Age 65",
        "fr": "Espérance de Vie Restante à l'Âge de 65 Ans"
      },
      {
        "en": "Lifespan Variation Calculated as Standard Deviation of Age at Death",
        "fr": "Variation de la Durée de Vie Calculée comme l'Écart-Type de l'Âge au Décès"
      },
      {
        "en": "Standard Deviation of Remaining Lifespan Conditional on Survival to Age 10",
        "fr": "Écart-Type de la Durée de Vie Restante Conditionnelle à la Survie Jusqu'à l'Âge de 10 Ans"
      },
      {
        "en": "Interquartile Range of Age at Death Distribution",
        "fr": "Intervalle Interquartile de la Distribution de l'Âge au Décès"
      },
      {
        "en": "Conditional Probability of Death Between Ages 20 and 65",
        "fr": "Probabilité Conditionnelle de Décès Entre les Âges de 20 et 65 Ans"
      },
      {
        "en": "Generating PDF report... Estimated time:",
        "fr": "Génération du rapport PDF... Temps estimé:"
      },
      {
        "en": "Heaping Diagnostics",
        "fr": "Diagnostics de concentration d'âges"
      },
      {
        "en": "Evaluate age heaping patterns for uploaded mortality data.",
        "fr": "Évaluer les schémas de concentration des âges pour les données de mortalité importées."
      },
      {
        "en": "Compute Bachi, Myers, Roughness, and Sawtooth indices to assess digit preference across ages.",
        "fr": "Calculez les indices de Bachi, Myers, Rugosité et Dent de scie pour évaluer les préférences de chiffres selon les âges."
      },
      {
        "en": "Upload your CSV, confirm grouping columns when prompted, then choose the variable you wish to evaluate.",
        "fr": "Téléchargez votre fichier CSV, confirmez les colonnes de regroupement lorsqu'elles sont demandées, puis choisissez la variable à évaluer."
      },
      {
        "en": "Run heaping analysis",
        "fr": "Lancer l'analyse de concentration"
      },
      {
        "en": "Upload CSV file",
        "fr": "Télécharger un fichier CSV"
      },
      {
        "en": "← Back to modules",
        "fr": "← Retour aux modules"
      },
      {
        "en": "Variable to evaluate",
        "fr": "Variable à évaluer"
      },
      {
        "en": "Controls",
        "fr": "Contrôles"
      },
      {
        "en": "Group to view",
        "fr": "Groupe à afficher"
      },
      {
        "en": "Download results",
        "fr": "Télécharger les résultats"
      },
      {
        "en": "Data source: %s",
        "fr": "Source des données : %s"
      },
      {
        "en": "Sample dataset",
        "fr": "Jeu de données d'exemple"
      },
      {
        "en": "Uploaded file",
        "fr": "Fichier téléversé"
      },
      {
        "en": "No grouping variables selected. Analysis will run on the entire dataset.",
        "fr": "Aucune variable de regroupement sélectionnée. L'analyse s'exécutera sur l'ensemble du jeu de données."
      },
      {
        "en": "No data available. Please upload a dataset first.",
        "fr": "Aucune donnée disponible. Veuillez d'abord téléverser un jeu de données."
      },
      {
        "en": "Please confirm the grouping modal before running the analysis.",
        "fr": "Veuillez confirmer la fenêtre de regroupement avant de lancer l'analyse."
      },
      {
        "en": "The selected group returned no rows to analyse.",
        "fr": "Le groupe sélectionné ne contient aucune ligne à analyser."
      },
      {
        "en": "Column '%s' is missing from the dataset.",
        "fr": "La colonne « %s » est absente du jeu de données."
      },
      {
        "en": "Heaping diagnostics failed. Check input data validity.",
        "fr": "Les diagnostics de concentration ont échoué. Vérifiez la validité des données d'entrée."
      },
      {
        "en": "Heaping diagnostics completed for %s (%s).",
        "fr": "Diagnostics de concentration terminés pour %s (%s)."
      },
      {
        "en": "Current group: %s",
        "fr": "Groupe actuel : %s"
      },
      {
        "en": "No diagnostics computed yet.",
        "fr": "Aucun diagnostic n'a encore été calculé."
      },
      {
        "en": "Identify age heaping patterns using Myers, Bachi, Roughness, and Sawtooth indices.",
        "fr": "Identifiez les schémas de concentration d'âges à l'aide des indices de Myers, Bachi, Rugosité et Dent de scie."
      },
      {
        "en": "Understand reporting accuracy in seconds",
        "fr": "Comprenez la précision des déclarations en quelques secondes"
      },
      {
        "en": "Assess age reporting quality",
        "fr": "Évaluez la qualité de la déclaration d'âge"
      },
      {
        "en": "Upload deaths or exposures and review digit-preference diagnostics before continuing your workflow.",
        "fr": "Téléversez les décès ou expositions et examinez les diagnostics de préférence pour les chiffres avant de poursuivre votre flux de travail."
      },
      {
        "en": "What you'll need",
        "fr": "Ce dont vous aurez besoin"
      },
      {
        "en": "Single-age or abridged ages with numeric Deaths and Exposures.",
        "fr": "Âges simples ou abrégés avec des nombres de décès et d'expositions numériques."
      },
      {
        "en": "Optional grouping columns (e.g. Sex, Region) if you plan to run diagnostics by subgroup.",
        "fr": "Colonnes de regroupement facultatives (p. ex., sexe, région) si vous souhaitez exécuter les diagnostics par sous-groupe."
      },
      {
        "en": "Select exposures or deaths to reveal digit-preference warnings before you progress into smoothing or graduation.",
        "fr": "Sélectionnez les expositions ou les décès pour afficher les alertes de préférence de chiffres avant de passer aux étapes de lissage ou de graduation."
      },
      {
        "en": "Single-age and abridged support",
        "fr": "Prise en charge des âges simples et abrégés"
      },
      {
        "en": "Instant classifications by severity",
        "fr": "Classements instantanés par niveau de gravité"
      },
      {
        "en": "Quick start checklist",
        "fr": "Liste de vérification de démarrage rapide"
      },
      {
        "en": "CSV columns must include Age, Deaths, and Exposures.",
        "fr": "Les colonnes du CSV doivent inclure l'âge, les décès et les expositions."
      },
      {
        "en": "When the modal opens, tick \"No grouping needed\" unless your file contains grouping identifiers.",
        "fr": "Lorsque la fenêtre s'ouvre, cochez « Aucun regroupement nécessaire » sauf si votre fichier contient des identifiants de regroupement."
      },
      {
        "en": "Use the toggle below to switch between Deaths and Exposures diagnostics.",
        "fr": "Utilisez le sélecteur ci-dessous pour basculer entre les diagnostics des décès et des expositions."
      },
      {
        "en": "How to prepare your data",
        "fr": "Comment préparer vos données"
      },
      {
        "en": "Ensure all ages are unique within each group, provide numeric counts, and reserve optional columns like Sex or Region for grouping selections.",
        "fr": "Assurez-vous que tous les âges sont uniques dans chaque groupe, fournissez des valeurs numériques et réservez les colonnes facultatives telles que le sexe ou la région pour les sélections de regroupement."
      },
      {
        "en": "Required:",
        "fr": "Obligatoire :"
      },
      {
        "en": "Optional:",
        "fr": "Facultatif :"
      },
      {
        "en": "Recommended:",
        "fr": "Recommandé :"
      },
      {
        "en": "Grouping columns (e.g., Sex, Province); leave blank and tick the checkbox if none apply.",
        "fr": "Colonnes de regroupement (p. ex., sexe, province); laissez vide et cochez la case si aucune ne s'applique."
      },
      {
        "en": "Provide exposures in the same scale as deaths for comparable indices.",
        "fr": "Fournissez les expositions dans la même échelle que les décès pour des indicateurs comparables."
      },
      {
        "en": "Sample heaping CSV preview",
        "fr": "Aperçu du CSV de concentration d'âges"
      },
      {
        "en": "Source: ODAPbackend::dat_heap_smooth.csv.gz (single-year age counts).",
        "fr": "Source : ODAPbackend::dat_heap_smooth.csv.gz (effectifs par âge, par année unique)."
      },
      {
        "en": "Tip: choose \"Deaths\" for Bachi/Myers and \"Exposures\" to inspect denominator quality.",
        "fr": "Astuce : choisissez « Décès » pour Bachi/Myers et « Expositions » pour examiner la qualité du dénominateur."
      },
      {
        "en": "Current group: awaiting selection",
        "fr": "Groupe actuel : en attente de sélection"
      },
      {
        "en": "All records",
        "fr": "Tous les enregistrements"
      },
      {
        "en": "We could not detect any data rows to tag. Please reload your dataset and try again.",
        "fr": "Nous n’avons détecté aucune ligne de données à marquer. Veuillez recharger votre jeu de données, puis réessayez."
      },
      {
        "en": "Smoothing Preview",
        "fr": "Aperçu du lissage"
      },
      {
        "en": "Preview mortality smoothing options before integrating them into your workflow.",
        "fr": "Prévisualisez les options de lissage de la mortalité avant de les intégrer à votre flux de travail."
      },
      {
        "en": "Graduation Tool",
        "fr": "Outil de graduation"
      },
      {
        "en": "Fine-tune mortality graduation methods with configurable infant and sex constraints.",
        "fr": "Affinez les méthodes de graduation de la mortalité avec des contraintes configurables pour les nourrissons et selon le sexe."
      }
    ]
}
